In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [3]:
csv_file = '../Resources/customer_data.csv'
customer_data_df = pd.read_csv(csv_file)
customer_data_df.head()

   id first_name last_name                       email  gender            car
0   1    Benetta   Cancott   bcancott0@studiopress.com  Female          Scion
1   2     Lilyan    Cherry  lcherry1@deliciousdays.com  Female       Chrysler
2   3    Ezekiel   Benasik         ebenasik2@wikia.com    Male  Mercedes-Benz
3   4    Kennedy     Atlay        katlay3@so-net.ne.jp    Male          Buick
4   5    Sanford    Salmen        ssalmen4@reuters.com    Male        Lincoln

In [8]:
json_file = '../Resources/customer_location.json'
customer_location_df = pd.read_json(json_file)
customer_location_df.head()

                 address  id  latitude  longitude  us_state
0  043 Mockingbird Place   1   39.1682   -86.5186   Indiana
1       4 Prentice Point   2   41.0938   -85.0707   Indiana
2      46 Derek Junction   3   32.7673   -96.7776     Texas
3  11966 Old Shore Place   4   39.0350   -94.3567  Missouri
4     5 Evergreen Circle   5   40.7808   -73.9772  New York

In [11]:
#
# connection_string = f'mysql://root:{password}@localhost:3306/customer_db'
connection_string = 'sqlite:///customer_db.sqlite'
engine = create_engine(connection_string)

In [16]:
engine.table_names()

['customer_location', 'customer_name']

In [13]:
engine.execute('CREATE TABLE customer_name (id INT PRIMARY KEY,first_name TEXT,last_name TEXT);')

In [15]:
engine.execute('CREATE TABLE customer_location (id INT PRIMARY KEY,   address TEXT,us_state TEXT);')

In [19]:
# customer_data_df.head()
cleaned_customer_data_df = customer_data_df[['id', 'first_name', 'last_name']]
cleaned_customer_data_df.head()

   id first_name last_name
0   1    Benetta   Cancott
1   2     Lilyan    Cherry
2   3    Ezekiel   Benasik
3   4    Kennedy     Atlay
4   5    Sanford    Salmen

In [20]:
cleaned_customer_data_df.to_sql(name='customer_name', con=engine, if_exists='append', index=False)

In [21]:
pd.read_sql_query('SELECT * FROM customer_name', con=engine).head()

   id first_name last_name
0   1    Benetta   Cancott
1   2     Lilyan    Cherry
2   3    Ezekiel   Benasik
3   4    Kennedy     Atlay
4   5    Sanford    Salmen

In [23]:
cleaned_customer_location_df = customer_location_df[['id', 'address', 'us_state']]
cleaned_customer_location_df.head()

   id                address  us_state
0   1  043 Mockingbird Place   Indiana
1   2       4 Prentice Point   Indiana
2   3      46 Derek Junction     Texas
3   4  11966 Old Shore Place  Missouri
4   5     5 Evergreen Circle  New York

In [24]:
cleaned_customer_location_df.to_sql(name='customer_location', con=engine, if_exists='append', index=False)

In [25]:
pd.read_sql_query('SELECT * FROM customer_location', con=engine).head()

   id                address  us_state
0   1  043 Mockingbird Place   Indiana
1   2       4 Prentice Point   Indiana
2   3      46 Derek Junction     Texas
3   4  11966 Old Shore Place  Missouri
4   5     5 Evergreen Circle  New York

In [27]:
query = """
SELECT
*
FROM customer_name A
INNER JOIN customer_location B ON A.id = B.id
"""

pd.read_sql_query(query, con=engine).head()

   id first_name last_name  id                address  us_state
0   1    Benetta   Cancott   1  043 Mockingbird Place   Indiana
1   2     Lilyan    Cherry   2       4 Prentice Point   Indiana
2   3    Ezekiel   Benasik   3      46 Derek Junction     Texas
3   4    Kennedy     Atlay   4  11966 Old Shore Place  Missouri
4   5    Sanford    Salmen   5     5 Evergreen Circle  New York